GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
                <register>
                    <name>LIFCLR</name>
                    <displayName>LIFCLR</displayName>
                    <description>low interrupt flag clear
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTXCIFLG3</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 3..0)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG3</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 3..0)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG3</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 3..0)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG3</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 3..0)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG3</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 3..0)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG2</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 3..0)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG2</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 3..0)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG2</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 3..0)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG2</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 3..0)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG2</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 3..0)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG1</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 3..0)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG1</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 3..0)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG1</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 3..0)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG1</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 3..0)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG1</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 3..0)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG0</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 3..0)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG0</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 3..0)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG0</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 3..0)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG0</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 3..0)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG0</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 3..0)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HIFCLR</name>
                    <displayName>HIFCLR</displayName>
                    <description>high interrupt flag clear
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CTXCIFLG7</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 7..4)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG7</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 7..4)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG7</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 7..4)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG7</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 7..4)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG7</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 7..4)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG6</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 7..4)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG6</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 7..4)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG6</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 7..4)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG6</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 7..4)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG6</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 7..4)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG5</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 7..4)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG5</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 7..4)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG5</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 7..4)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG5</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 7..4)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG5</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 7..4)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXCIFLG4</name>
                            <description>Stream x clear transfer complete
              interrupt flag (x = 7..4)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CHTXIFLG4</name>
                            <description>Stream x clear half transfer interrupt
              flag (x = 7..4)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTXEIFLG4</name>
                            <description>Stream x clear transfer error interrupt
              flag (x = 7..4)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CDMEIFLG4</name>
                            <description>Stream x clear direct mode error
              interrupt flag (x = 7..4)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CFEIFLG4</name>
                            <description>Stream x clear FIFO error interrupt flag
              (x = 7..4)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFG0</name>
                    <displayName>SCFG0</displayName>
                    <description>stream x configuration
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHSEL</name>
                            <description>Channel selection</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MBCFG</name>
                            <description>Memory burst transfer
              configuration</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PBCFG</name>
                            <description>Peripheral burst transfer
              configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>CTARG</name>
                            <description>Current target (only in double buffer
              mode)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBM</name>
                            <description>Double buffer mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRILCFG</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERIOSIZE</name>
                            <description>Peripheral increment offset
              size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MEMSIZECFG</name>
                            <description>Memory data size</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZECFG</name>
                            <description>Peripheral data size</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MEMIM</name>
                            <description>Memory increment mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIM</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRCMEN</name>
                            <description>Circular mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERFC</name>
                            <description>Peripheral flow controller</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIEN</name>
                            <description>Transfer complete interrupt
              enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIEN</name>
                            <description>Half transfer interrupt
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIEN</name>
                            <description>Transfer error interrupt
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIEN</name>
                            <description>Direct mode error interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Stream enable / flag stream ready when
              read low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDATA0</name>
                    <displayName>NDATA0</displayName>
                    <description>stream x number of data
          register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATA</name>
                            <description>Number of data items to
              transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PADDR0</name>
                    <displayName>PADDR0</displayName>
                    <description>stream x peripheral address
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
