GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
                <register>
                    <name>M0ADDR2</name>
                    <displayName>M0ADDR2</displayName>
                    <description>stream x memory 0 address
          register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M0ADDR</name>
                            <description>Memory 0 address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M1ADDR2</name>
                    <displayName>M1ADDR2</displayName>
                    <description>stream x memory 1 address
          register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M1ADDR</name>
                            <description>Memory 1 address (used in case of Double
              buffer mode)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTRL2</name>
                    <displayName>FCTRL2</displayName>
                    <description>stream x FIFO control register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000021</resetValue>
                    <fields>
                        <field>
                            <name>FEIEN</name>
                            <description>FIFO error interrupt
              enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSTS</name>
                            <description>FIFO status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMDEN</name>
                            <description>Direct mode disable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTHSEL</name>
                            <description>FIFO threshold selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFG3</name>
                    <displayName>SCFG3</displayName>
                    <description>stream x configuration
          register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHSEL</name>
                            <description>Channel selection</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MBCFG</name>
                            <description>Memory burst transfer
              configuration</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PBCFG</name>
                            <description>Peripheral burst transfer
              configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>ACK</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTARG</name>
                            <description>Current target (only in double buffer
              mode)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBM</name>
                            <description>Double buffer mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRILCFG</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERIOSIZE</name>
                            <description>Peripheral increment offset
              size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MEMSIZECFG</name>
                            <description>Memory data size</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZECFG</name>
                            <description>Peripheral data size</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MEMIM</name>
                            <description>Memory increment mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIM</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRCMEN</name>
                            <description>Circular mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERFC</name>
                            <description>Peripheral flow controller</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIEN</name>
                            <description>Transfer complete interrupt
              enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIEN</name>
                            <description>Half transfer interrupt
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIEN</name>
                            <description>Transfer error interrupt
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIEN</name>
                            <description>Direct mode error interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Stream enable / flag stream ready when
              read low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDATA3</name>
                    <displayName>NDATA3</displayName>
                    <description>stream x number of data
          register</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATA</name>
                            <description>Number of data items to
              transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PADDR3</name>
                    <displayName>PADDR3</displayName>
                    <description>stream x peripheral address
          register</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M0ADDR3</name>
                    <displayName>M0ADDR3</displayName>
                    <description>stream x memory 0 address
          register</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M0ADDR</name>
                            <description>Memory 0 address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>M1ADDR3</name>
                    <displayName>M1ADDR3</displayName>
                    <description>stream x memory 1 address
          register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>M1ADDR</name>
                            <description>Memory 1 address (used in case of Double
              buffer mode)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>FCTRL3</name>
                    <displayName>FCTRL3</displayName>
                    <description>stream x FIFO control register</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000021</resetValue>
                    <fields>
                        <field>
                            <name>FEIEN</name>
                            <description>FIFO error interrupt
              enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSTS</name>
                            <description>FIFO status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DMDEN</name>
                            <description>Direct mode disable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FTHSEL</name>
                            <description>FIFO threshold selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SCFG4</name>
                    <displayName>SCFG4</displayName>
                    <description>stream x configuration
          register</description>
                    <addressOffset>0x70</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CHSEL</name>
                            <description>Channel selection</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MBCFG</name>
                            <description>Memory burst transfer
              configuration</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PBCFG</name>
                            <description>Peripheral burst transfer
              configuration</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ACK</name>
                            <description>ACK</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CTARG</name>
                            <description>Current target (only in double buffer
              mode)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBM</name>
                            <description>Double buffer mode</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PRILCFG</name>
                            <description>Priority level</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERIOSIZE</name>
                            <description>Peripheral increment offset
              size</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MEMSIZECFG</name>
                            <description>Memory data size</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERSIZECFG</name>
                            <description>Peripheral data size</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MEMIM</name>
                            <description>Memory increment mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PERIM</name>
                            <description>Peripheral increment mode</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CIRCMEN</name>
                            <description>Circular mode</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DIRCFG</name>
                            <description>Data transfer direction</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>PERFC</name>
                            <description>Peripheral flow controller</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIEN</name>
                            <description>Transfer complete interrupt
              enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIEN</name>
                            <description>Half transfer interrupt
              enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIEN</name>
                            <description>Transfer error interrupt
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIEN</name>
                            <description>Direct mode error interrupt
              enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EN</name>
                            <description>Stream enable / flag stream ready when
              read low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>NDATA4</name>
                    <displayName>NDATA4</displayName>
                    <description>stream x number of data
          register</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>NDATA</name>
                            <description>Number of data items to
              transfer</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PADDR4</name>
                    <displayName>PADDR4</displayName>
                    <description>stream x peripheral address
          register</description>
                    <addressOffset>0x78</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PADDR</name>
                            <description>Peripheral address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
