GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
                <register>
                    <name>CTRL3</name>
                    <displayName>CTRL3</displayName>
                    <description>Control register 3</description>
                    <addressOffset>0xF4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000200</resetValue>
                    <fields>
                        <field>
                            <name>IAT</name>
                            <description>IAT</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ADDRLEN</name>
                            <description>ADDRLEN</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INSLEN</name>
                            <description>INSLEN</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WAITCYC</name>
                            <description>WAITCYC</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CSEN</name>
                            <description>CSEN</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIP_INCR_INST</name>
                    <displayName>XIP_INCR_INST</displayName>
                    <description>XIP INCR transfer opcode register</description>
                    <addressOffset>0x100</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>INCR_INST</name>
                            <description>INCR_INST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIP_WRAP_INST</name>
                    <displayName>XIP_WRAP_INST</displayName>
                    <description>XIP_WRAP_INST transfer opcode register</description>
                    <addressOffset>0x104</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>WRAP_INST</name>
                            <description>WRAP_INST</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIP_CTRL</name>
                    <displayName>XIP_CTRL</displayName>
                    <description>XIP Control Register</description>
                    <addressOffset>0x108</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x08000401</resetValue>
                    <fields>
                        <field>
                            <name>FRF</name>
                            <description>FRF</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TRANS_TYPE</name>
                            <description>TRANS_TYPE</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADDR_L</name>
                            <description>ADDR_L</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>INST_L</name>
                            <description>INST_L</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>WAIT_CYCLES</name>
                            <description>WAIT_CYCLES</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>DFS_HC</name>
                            <description>DFS_HC</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INST_EN</name>
                            <description>INST_EN</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CONT_XFER_EN</name>
                            <description>CONT_XFER_EN</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>XIP_PREFETCH_EN</name>
                            <description>XIP_PREFETCH_EN</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIP_SER</name>
                    <displayName>XIP_SER</displayName>
                    <description>Enable Register of the Machine</description>
                    <addressOffset>0x10C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>SER</name>
                            <description>SER</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWITCH</name>
                    <displayName>SWITCH</displayName>
                    <description>IO switch register</description>
                    <addressOffset>0x200</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>SWITCH</name>
                            <description>I/O switch</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LITTLE_ENDIAN_EN</name>
                            <description>Little endian enabled</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>XIP_EN</name>
                    <displayName>XIP_EN</displayName>
                    <description>XIP Enable Register.</description>
                    <addressOffset>0x204</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>XIP_EN</name>
                            <description>XIP_EN</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
