GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>Ethernet_MAC</name>
            <description>Ethernet: media access control (MAC)</description>
            <groupName>Ethernet</groupName>
            <baseAddress>0x40028000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x61</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>ETH</name>
                <description>Ethernet global interrupt</description>
                <value>61</value>
            </interrupt>
            <interrupt>
                <name>ETH_WKUP</name>
                <description>Ethernet Wakeup through EINT line
        interrupt</description>
                <value>62</value>
            </interrupt>
            <registers>
                <register>
                    <name>MACCFG</name>
                    <displayName>MACCFG</displayName>
                    <description>Ethernet MAC configuration
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0008000</resetValue>
                    <fields>
                        <field>
                            <name>RXEN</name>
                            <description>Receiver Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEN</name>
                            <description>Transmitter Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DC</name>
                            <description>Deferral Check</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BL</name>
                            <description>Back off Limit</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ACS</name>
                            <description>Automatic Pad or CRC Stripping</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISR</name>
                            <description>Disable Retry</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IPC</name>
                            <description>IPv4 Checksum offload</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DM</name>
                            <description>Duplex Mode</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>LBM</name>
                            <description>Loopback Mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISRXO</name>
                            <description>Disable Receive Own</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SSEL</name>
                            <description>Speed</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISCRS</name>
                            <description>Disable Carrier Sense During Transmission</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>IFG</name>
                            <description>Inter-Frame Gap</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>JDIS</name>
                            <description>Jabber Disable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WDTDIS</name>
                            <description>Watchdog Disable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CST</name>
                            <description>CRC Stripping for Type Frames</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACFRAF</name>
                    <displayName>MACFRAF</displayName>
                    <description>Ethernet MAC frame filter
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PR</name>
                            <description>Promiscuous Mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HUC</name>
                            <description>Hash Unicast</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HMC</name>
                            <description>Hash Multicast</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DAIF</name>
                            <description>DA Inverse Filtering</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PM</name>
                            <description>Pass All Multicast</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DISBF</name>
                            <description>Disable Broadcast Frames</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCTRLF</name>
                            <description>Pass Control Frames</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>SAIF</name>
                            <description>SA Inverse Filtering</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SAFEN</name>
                            <description>Source Address Filter Enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HPF</name>
                            <description>Hash or Perfect Filter</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXA</name>
                            <description>Receive All</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACHTH</name>
                    <displayName>MACHTH</displayName>
                    <description>Ethernet MAC hash table high
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTH</name>
                            <description>Hash Table High</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACHTL</name>
                    <displayName>MACHTL</displayName>
                    <description>Ethernet MAC hash table low
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>HTL</name>
                            <description>Hash Table Low</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACADDR</name>
                    <displayName>MACADDR</displayName>
                    <description>Ethernet MAC MII address
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MB</name>
                            <description>MII Busy</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MW</name>
                            <description>MII Write</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CR</name>
                            <description>Clock Range</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MR</name>
                            <description>MII Register</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                        <field>
                            <name>PA</name>
                            <description>Physical Layer Address</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACDATA</name>
                    <displayName>MACDATA</displayName>
                    <description>Ethernet MAC MII data register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MD</name>
                            <description>MII Data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACFCTRL</name>
                    <displayName>MACFCTRL</displayName>
                    <description>Ethernet MAC flow control
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FCTRLB_BPA</name>
                            <description>Flow Control Busy/Back Pressure Activate</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXFCTRLEN</name>
                            <description>Transmit Flow Control Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFCTRLEN</name>
                            <description>Receive Flow Control Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UNPFDETE</name>
                            <description>Unicast Pause Frame Detect</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PTSEL</name>
                            <description>Pause Threshold Select</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ZQPDIS</name>
                            <description>Zero-quanta Pause Disable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PT</name>
                            <description>Pause Time</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACVLANT</name>
                    <displayName>MACVLANT</displayName>
                    <description>Ethernet MAC VLAN tag register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>VLANTID</name>
                            <description>VLAN Tag Identifier</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                        <field>
                            <name>VLANTCOMP</name>
                            <description>12-bit VLAN Tag Comparison</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MACPMTCTRLSTS</name>
                    <displayName>MACPMTCTRLSTS</displayName>
                    <description>Ethernet MAC PMT control and status
          register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PD</name>
                            <description>Power Down</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MPEN</name>
                            <description>Magic Packet Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPFEN</name>
                            <description>Wakeup Frame Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MPRX</name>
                            <description>Magic Packet Received</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPFRX</name>
                            <description>Wakeup Frame Received</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GUN</name>
                            <description>Global Unicast</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WKUPFRST</name>
                            <description>Wakeup Frame Filter Register Pointer Reset</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
