GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>Ethernet_MMC</name>
            <description>Ethernet: MAC management counters</description>
            <groupName>Ethernet</groupName>
            <baseAddress>0x40028100</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>Ethernet MMC control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CNTRST</name>
                            <description>Counter Reset</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CNTSTOPRO</name>
                            <description>Counter Stop Rollover</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RSTOR</name>
                            <description>Reset on read</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCNTF</name>
                            <description>MMC Counter Freeze</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCNTP</name>
                            <description>MMC Counter Preset</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MCNTVALP</name>
                            <description>MMC Counter Value Preset</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXINT</name>
                    <displayName>RXINT</displayName>
                    <description>Ethernet MMC receive interrupt
          register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCE</name>
                            <description>Received Frames CRC Error</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFAE</name>
                            <description>Received Frames Alignment Error</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXGUNF</name>
                            <description>Received Good Unicast Frames</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXINT</name>
                    <displayName>TXINT</displayName>
                    <description>Ethernet MMC transmit interrupt
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCOL</name>
                            <description>Transmitted Good Frames Single Collision</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFMCOL</name>
                            <description>Transmitted Good Frames More Single Collision</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGF</name>
                            <description>Transmitted Good Frames</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXINTMASK</name>
                    <displayName>RXINTMASK</displayName>
                    <description>Ethernet MMC receive interrupt mask
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCEM</name>
                            <description>Received Frames CRC Error Mask</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXFAEM</name>
                            <description>Received Frames Alignment Error Mask</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXGUNFM</name>
                            <description>Received Good Unicast Frames Mask</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXINTMASK</name>
                    <displayName>TXINTMASK</displayName>
                    <description>Ethernet MMC transmit interrupt mask
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCOLM</name>
                            <description>Transmitted Good Frames Single Collision Mask</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFMCOLM</name>
                            <description>ransmitted Good Frames More Single Collision Mask</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXGFM</name>
                            <description>Transmitted Good Frames Mask</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFSCCNT</name>
                    <displayName>TXGFSCCNT</displayName>
                    <description>Ethernet MMC transmitted good frames after a
          single collision counter</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFSCCNT</name>
                            <description>Transmitted Good Frames Single Collision Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFMCCNT</name>
                    <displayName>TXGFMCCNT</displayName>
                    <description>Ethernet MMC transmitted good frames after
          more than a single collision</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFMCCNT</name>
                            <description>Transmitted Good Frames More Collision Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>TXGFCNT</name>
                    <displayName>TXGFCNT</displayName>
                    <description>Ethernet MMC transmitted good frames counter
          register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXGFCNT</name>
                            <description>Transmitted Good Frames Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFCECNT</name>
                    <displayName>RXFCECNT</displayName>
                    <description>Ethernet MMC received frames with CRC error
          counter register</description>
                    <addressOffset>0x94</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCECNT</name>
                            <description>Received Frames CRC Error Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXFAECNT</name>
                    <displayName>RXFAECNT</displayName>
                    <description>Ethernet MMC received frames with alignment
          error counter register</description>
                    <addressOffset>0x98</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFAECNT</name>
                            <description>Received Frames Alignment Error Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RXGUNCNT</name>
                    <displayName>RXGUNCNT</displayName>
                    <description>MMC received good unicast frames counter
          register</description>
                    <addressOffset>0xC4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXFCECNT</name>
                            <description>Received Good Unicast Frames Counter</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
