GeehySemi/APM32F4xx_SDK/Utilities/SVD/APM32F423.svd
                <register>
                    <name>DIEPINT3</name>
                    <displayName>DIEPINT3</displayName>
                    <description>device endpoint-3 interrupt
          register</description>
                    <addressOffset>0x168</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>TXFE</name>
                            <description>TXFIFO Empty Interrupt</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IEPNAKE</name>
                            <description>IN Endpoint NAK Effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITXEMP</name>
                            <description>Receive IN Token Interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TO</name>
                            <description>Timeout Interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint Interrupt Disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer Complete Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT0</name>
                    <displayName>DOEPINT0</displayName>
                    <description>device endpoint-0 interrupt
          register</description>
                    <addressOffset>0x308</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>RXBSP</name>
                            <description>Receive Back-to-Back SETUP Packet Interrupt</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>Receive OUT Token Disable Interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP Phase Done Interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint Interrupt Disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer Complete Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT1</name>
                    <displayName>DOEPINT1</displayName>
                    <description>device endpoint-1 interrupt
          register</description>
                    <addressOffset>0x328</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>RXBSP</name>
                            <description>Receive Back-to-Back SETUP Packet Interrupt</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>Receive OUT Token Disable Interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP Phase Done Interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint Interrupt Disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer Complete Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT2</name>
                    <displayName>DOEPINT2</displayName>
                    <description>device endpoint-2 interrupt
          register</description>
                    <addressOffset>0x348</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>RXBSP</name>
                            <description>Receive Back-to-Back SETUP Packet Interrupt</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>Receive OUT Token Disable Interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP Phase Done Interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint Interrupt Disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer Complete Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPINT3</name>
                    <displayName>DOEPINT3</displayName>
                    <description>device endpoint-3 interrupt
          register</description>
                    <addressOffset>0x368</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>RXBSP</name>
                            <description>Receive Back-to-Back SETUP Packet Interrupt</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RXOTDIS</name>
                            <description>Receive OUT Token Disable Interrupt</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>SETUP Phase Done Interrupt</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint Interrupt Disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer Complete Interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS0</name>
                    <displayName>DIEPTRS0</displayName>
                    <description>device endpoint-0 transfer size
          register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS0</name>
                    <displayName>DOEPTRS0</displayName>
                    <description>device OUT endpoint-0 transfer size
          register</description>
                    <addressOffset>0x310</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPCNT</name>
                            <description>SETUP packet count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS1</name>
                    <displayName>DIEPTRS1</displayName>
                    <description>device endpoint-1 transfer size
          register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS2</name>
                    <displayName>DIEPTRS2</displayName>
                    <description>device endpoint-2 transfer size
          register</description>
                    <addressOffset>0x150</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS3</name>
                    <displayName>DIEPTRS3</displayName>
                    <description>device endpoint-3 transfer size
          register</description>
                    <addressOffset>0x170</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS0</name>
                    <displayName>DITXFSTS0</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x118</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS1</name>
                    <displayName>DITXFSTS1</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x138</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS2</name>
                    <displayName>DITXFSTS2</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x158</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS3</name>
                    <displayName>DITXFSTS3</displayName>
                    <description>OTG_FS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x178</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              available</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS1</name>
                    <displayName>DOEPTRS1</displayName>
                    <description>device OUT endpoint-1 transfer size
          register</description>
                    <addressOffset>0x330</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>Received data PID/SETUP packet
              count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPTRS2</name>
                    <displayName>DOEPTRS2</displayName>
                    <description>device OUT endpoint-2 transfer size
          register</description>
                    <addressOffset>0x350</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RXDPID_SPCNT</name>
                            <description>Received data PID/SETUP packet
              count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
